{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "salutation",
    "1": "qui_es_tu",
    "2": "competences",
    "3": "formation",
    "4": "projets",
    "5": "outils",
    "6": "contact",
    "7": "langues",
    "8": "formations_suivies",
    "9": "technologies_frontend",
    "10": "technologies_backend",
    "11": "s\u00e9curit\u00e9_donn\u00e9es",
    "12": "motivation",
    "13": "collaboration",
    "14": "defis",
    "15": "hobbies",
    "16": "futur",
    "17": "aide",
    "18": "blagues",
    "19": "actualit\u00e9s_tech",
    "20": "feedback",
    "21": "personnalisation",
    "22": "statistiques",
    "23": "mise_a_jour",
    "24": "tutoriels",
    "25": "optimisation_nlp",
    "26": "fallback"
  },
  "initializer_range": 0.02,
  "label2id": {
    "actualit\u00e9s_tech": 19,
    "aide": 17,
    "blagues": 18,
    "collaboration": 13,
    "competences": 2,
    "contact": 6,
    "defis": 14,
    "fallback": 26,
    "feedback": 20,
    "formation": 3,
    "formations_suivies": 8,
    "futur": 16,
    "hobbies": 15,
    "langues": 7,
    "mise_a_jour": 23,
    "motivation": 12,
    "optimisation_nlp": 25,
    "outils": 5,
    "personnalisation": 21,
    "projets": 4,
    "qui_es_tu": 1,
    "salutation": 0,
    "statistiques": 22,
    "s\u00e9curit\u00e9_donn\u00e9es": 11,
    "technologies_backend": 10,
    "technologies_frontend": 9,
    "tutoriels": 24
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "vocab_size": 119547
}
